app/controllers/chefs_controller.rb

  def index
    @chefs = Chef.paginate(page: params[:pag], per_page: 3)
---
SELECT  "chefs".* FROM "chefs" LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM "chefs"

  def create
    @chef = Chef.new(chef_params)
    if @chef.save
---
INSERT INTO "chefs" ("chefname", "email", "password_digest", "username", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @chef.update(chef_params)
---
UPDATE "chefs" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "chefs"."id" = ?  [["email", "[\"changed@gmail.com\", \"Michaelc\"]"], ["password_digest", "$2a$10$RnW//2dhI5o9foKMN4eN/.8dUJnMURAt3g49nWtKSB4f7lLUfFT6m"], ["updated_at", "2015-04-01 07:42:18.576043"], ["id", 3]]

  def show
    @recipes = @chef.recipes.paginate(page: params[:page], per_page: 3)
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."chef_id" = ?  ORDER BY "recipes"."updated_at" DESC LIMIT 3 OFFSET 0  [["chef_id", 2]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."chef_id" = ?  [["chef_id", 1]]

    def set_chef
      @chef = Chef.find(params[:id])
---
SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 3]]