app/controllers/logins_controller.rb

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."username" = ? LIMIT 1  [["username", "michaelchang"]]
---
  def create
    chef = Chef.find_by(username: params[:username])