app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes"  ORDER BY "recipes"."updated_at" DESC LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "recipes"
---
  def index
    # @recipes = Recipe.all.sort_by{|likes| likes.thumbs_up_total}.reverse
    @recipes = Recipe.paginate(page: params[:page], per_page: 4)

INSERT INTO "recipes" ("name", "summary", "description", "picture", "chef_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = current_user

    if @recipe.save

UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "fdsfdsfdsfdsfdskfskdljf\r\njdskfjdlskf\r\njdskfjsdklfjdsf\r\nfdsjkdsf"], ["updated_at", "2015-03-31 07:40:57.244539"], ["id", 11]]
---
  def update
    if @recipe.update(recipe_params)

INSERT INTO "likes" ("like", "chef_id", "recipe_id") VALUES (?, ?, ?)  [["like", "t"], ["chef_id", 3], ["recipe_id", 2]]
---
  def like
    like = Like.create(like: params[:like], chef: current_user, recipe: @recipe)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ?  ORDER BY "recipes"."updated_at" DESC LIMIT 1  [["id", 11]]
---
    def set_recipe
      @recipe = Recipe.find(params[:id])