app/controllers/recipes_controller.rb

SELECT  "chefs".* FROM "chefs" WHERE "chefs"."id" = ? LIMIT 1  [["id", 2]]
---
  def create
    @recipe = Recipe.new(recipe_params)
    @recipe.chef = Chef.find(2)